/***************************************************************************
**   					             华东交通大学 RealSteel战队
**   					               铁甲钢拳，风驰电掣!
**-------------------------------------------------------------------------
** 项    目：   STM32G0_Board
** 文 件 名：   test.c
** 文件说明：   教程测试程序
**-------------------------------------------------------------------------
**						*修订*
**	*版本*							*修改内容*							*修改人*      			 *日期*
**	 1.0							   初始版本						     黄宇阳     	     2024-11-23
***************************************************************************/

#include "main.h"
#include "tim.h"
#include "gpio.h"
#include "stdint.h"
#include "test.h"
#include "buzzer.h"

#define MAX_PSC             500			//分频系数
#define MAX_BUZZER_PWM      2500		//重载值上限
#define MIN_BUZZER_PWM      500			//重载值下限

uint16_t psc = 0;
uint16_t pwm = MIN_BUZZER_PWM;


/***********************************************************************
** 函 数 名： setup()
** 函数说明： 程序初始化函数，上电后执行一次
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void Setup()
{
	//start tim
	//开启定时器
	HAL_TIM_Base_Start(&htim1);
	//start pwm channel
	//开启PWM通道
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	//关闭蜂鸣器
	buzzer_off();
}

/***********************************************************************
** 函 数 名： Loop()
** 函数说明： 程序主循环函数，上电后循环执行
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void Loop()
{
	psc++;
	//设 置 pwm 的值在MIN_BUZZER_PWM和 MAX_BUZZER_PWM之间变动
	if(pwm > MAX_BUZZER_PWM)
	{
			pwm = MIN_BUZZER_PWM;
	}
	//psc 的值在0 和 MAX_PSC之间变动
	if(psc > MAX_PSC)
	{
			psc = 0;
	}
	//蜂鸣器开启
	buzzer_on(psc, pwm);		
	HAL_Delay(1);

}
